Австралия/src/AccumulationRegisters/FundsTransfersBeingProcessed/FundsTransfersBeingProcessed.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>FundsTransfersBeingProcessed</name>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FeeAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentProcessor</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentProcessorContract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>POSTerminal</name>
    <type>
      <types>CatalogRef.POSTerminals</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.OnlineReceipt</types>
      <types>DocumentRef.OnlinePayment</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Documents/OnlinePayment/OnlinePayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>OnlinePayment</name>
  <basedOn>Document.OnlineReceipt</basedOn>
  <basedOn>Document.SalesOrder</basedOn>
  <basedOn>Document.CreditNote</basedOn>
  <registerRecords>AccumulationRegister.VATOutput</registerRecords>
  <registerRecords>AccumulationRegister.InvoicesAndOrdersPayment</registerRecords>
  <registerRecords>InformationRegister.AccountingEntriesData</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccumulationRegister.FundsTransfersBeingProcessed</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>AccumulationRegister.AccountsReceivable</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyVATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.CreditNote</types>
      <types>DocumentRef.OnlineReceipt</types>
    </type>
  </attributes>
  <attributes>
    <name>OperationKind</name>
    <type>
      <types>EnumRef.OperationTypesOnlinePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>POSTerminal</name>
    <type>
      <types>CatalogRef.POSTerminals</types>
    </type>
  </attributes>
  <attributes>
    <name>CashCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ChargeCardKind</name>
    <type>
      <types>CatalogRef.PaymentCardTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ChargeCardNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>24</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentStatus</name>
    <type>
      <types>EnumRef.PaymentStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>FeePercent</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FeeAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FeeFixedPart</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FeeTotal</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>VATTaxation</name>
    <type>
      <types>EnumRef.VATTaxationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PaymentDetails</name>
    <attributes>
      <name>Contract</name>
      <type>
        <types>CatalogRef.CounterpartyContracts</types>
      </type>
    </attributes>
    <attributes>
      <name>AdvanceFlag</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.SalesInvoice</types>
        <types>DocumentRef.CashReceipt</types>
        <types>DocumentRef.CreditNote</types>
        <types>DocumentRef.OnlineReceipt</types>
        <types>DocumentRef.PaymentReceipt</types>
      </type>
    </attributes>
    <attributes>
      <name>SettlementsAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ExchangeRate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>CatalogRef.VATRates</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Order</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.CashFlowItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountsReceivableGLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>AdvancesReceivedGLAccount</name>
      <type>
        <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/AccumulationRegisters/FundsTransfersBeingProcessed/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
		Or Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	FundsTransfersBeingProcessed.LineNumber AS LineNumber,
	|	FundsTransfersBeingProcessed.Company AS Company,
	|	FundsTransfersBeingProcessed.PresentationCurrency AS PresentationCurrency,
	|	FundsTransfersBeingProcessed.PaymentProcessor AS PaymentProcessor,
	|	FundsTransfersBeingProcessed.PaymentProcessorContract AS PaymentProcessorContract,
	|	FundsTransfersBeingProcessed.POSTerminal AS POSTerminal,
	|	FundsTransfersBeingProcessed.Currency AS Currency,
	|	FundsTransfersBeingProcessed.Document AS Document,
	|	FundsTransfersBeingProcessed.AmountCur AS AmountCurBeforeWrite,
	|	FundsTransfersBeingProcessed.AmountCur AS AmountCurChange,
	|	FundsTransfersBeingProcessed.AmountCur AS AmountCurOnWrite,
	|	FundsTransfersBeingProcessed.FeeAmount AS FeeAmountBeforeWrite,
	|	FundsTransfersBeingProcessed.FeeAmount AS FeeAmountChange,
	|	FundsTransfersBeingProcessed.FeeAmount AS FeeAmountOnWrite
	|INTO RegisterRecordsFundsTransfersBeingProcessedChange
	|FROM
	|	AccumulationRegister.FundsTransfersBeingProcessed AS FundsTransfersBeingProcessed");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsFundsTransfersBeingProcessedChange", False);
	
EndProcedure

Function BalancesControlQueryText() Export
	
	Return
	"SELECT
	|	RegisterRecordsFundsTransfersBeingProcessedChange.LineNumber AS LineNumber,
	|	RegisterRecordsFundsTransfersBeingProcessedChange.Company AS Company,
	|	RegisterRecordsFundsTransfersBeingProcessedChange.PresentationCurrency AS PresentationCurrency,
	|	RegisterRecordsFundsTransfersBeingProcessedChange.PaymentProcessor AS PaymentProcessor,
	|	RegisterRecordsFundsTransfersBeingProcessedChange.PaymentProcessorContract AS PaymentProcessorContract,
	|	RegisterRecordsFundsTransfersBeingProcessedChange.POSTerminal AS POSTerminal,
	|	RegisterRecordsFundsTransfersBeingProcessedChange.Currency AS Currency,
	|	RegisterRecordsFundsTransfersBeingProcessedChange.Document AS Document,
	|	RegisterRecordsFundsTransfersBeingProcessedChange.AmountCurChange + ISNULL(FundsTransfersBeingProcessedBalances.AmountCurBalance, 0) AS AmountCurBalanceBeforeChange,
	|	ISNULL(FundsTransfersBeingProcessedBalances.AmountCurBalance, 0) AS AmountCurBalance,
	|	RegisterRecordsFundsTransfersBeingProcessedChange.FeeAmountChange + ISNULL(FundsTransfersBeingProcessedBalances.FeeAmountBalance, 0) AS FeeAmountBalanceBeforeChange,
	|	ISNULL(FundsTransfersBeingProcessedBalances.FeeAmountBalance, 0) AS FeeAmountBalance
	|FROM
	|	RegisterRecordsFundsTransfersBeingProcessedChange AS RegisterRecordsFundsTransfersBeingProcessedChange
	|		LEFT JOIN AccumulationRegister.FundsTransfersBeingProcessed.Balance(&ControlTime, ) AS FundsTransfersBeingProcessedBalances
	|		ON RegisterRecordsFundsTransfersBeingProcessedChange.Company = FundsTransfersBeingProcessedBalances.Company
	|			AND RegisterRecordsFundsTransfersBeingProcessedChange.PresentationCurrency = FundsTransfersBeingProcessedBalances.PresentationCurrency
	|			AND RegisterRecordsFundsTransfersBeingProcessedChange.PaymentProcessor = FundsTransfersBeingProcessedBalances.PaymentProcessor
	|			AND RegisterRecordsFundsTransfersBeingProcessedChange.PaymentProcessorContract = FundsTransfersBeingProcessedBalances.PaymentProcessorContract
	|			AND RegisterRecordsFundsTransfersBeingProcessedChange.POSTerminal = FundsTransfersBeingProcessedBalances.POSTerminal
	|			AND RegisterRecordsFundsTransfersBeingProcessedChange.Currency = FundsTransfersBeingProcessedBalances.Currency
	|			AND RegisterRecordsFundsTransfersBeingProcessedChange.Document = FundsTransfersBeingProcessedBalances.Document
	|WHERE
	|	(CASE
	|				WHEN RegisterRecordsFundsTransfersBeingProcessedChange.Document REFS Document.OnlinePayment
	|					THEN ISNULL(FundsTransfersBeingProcessedBalances.AmountCurBalance, 0) > 0
	|				ELSE ISNULL(FundsTransfersBeingProcessedBalances.AmountCurBalance, 0) < 0
	|			END
	|			OR ISNULL(FundsTransfersBeingProcessedBalances.FeeAmountBalance, 0) < 0)
	|
	|ORDER BY
	|	LineNumber";
	
EndFunction

#EndRegion

#EndIf
